python/python3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>python3</title>
<!-- 2016-08-24 Wed 19:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Fernanda Sanchez" />
</head>
<body>
<div id="content">
<h1 class="title">python3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Tipos</a></li>
<li><a href="#sec-2">2. Números Complejos</a>
<ul>
<li><a href="#sec-2-1">2.1. Funciones para números complejos</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Computación Simbólica</a></li>
<li><a href="#sec-4">4. Solución de ecuaciones</a></li>
<li><a href="#sec-5">5. Ejercicio</a></li>
</ul>
</div>
</div>
<p>
#-*- mode: org -*-
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tipos</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-python">type(’Hello, World!’)
# &lt;type ’str’&gt;

type(17)
# &lt;type ’int’&gt;

type(3.2)
# &lt;type ’float’&gt;

type(’3.2’)
# &lt;type ’str’&gt;

c = float(17)
type(c)
# &lt;type ’float’&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Números Complejos</h2>
<div class="outline-text-2" id="text-2">
<p>
\[ x = sqrt(-2) \]
</p>

<p>
La solución es un número complejo.
Un número complejo es un par de número reales a, b y una parte imaginaria:
 a + bi
donde \[ i = sqrt(-1) \]
</p>

<p>
El número \[2 - 3i \] se escribe en python: (2-3j)
</p>

<div class="org-src-container">

<pre class="src src-python">u = 2.5 + 3j # create a complex number
v = 2 # this is an int
w = u + v # complex + int
w
# (4.5+3j)

a = -2
b = 0.5
s = a + b*1j # create a complex number from two floats
s = complex(a, b) # alternative creation
s
# (-2+0.5j)

s*w # complex*complex
# (-10.5-3.75j)

s/w # complex/complex
# (-0.25641025641025639+0.28205128205128205j)

s.real
# -2.0
s.imag
# 0.5
s.conjugate()
# (-2-0.5j)
</pre>
</div>

<p>
La multiplicación de números complejos:
(x + yi)(u + vi) = (xu - yv) + (xv + yu)i
</p>
</div>


<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Funciones para números complejos</h3>
<div class="outline-text-3" id="text-2-1">
<p>
El seno de un número complejo no esta definido en el modulo math de python.
</p>

<div class="org-src-container">

<pre class="src src-python">from math import sin
r = sin(w)
# Traceback (most recent call last):
# File "&lt;input&gt;", line 1, in ?
# TypeError: can’t convert complex to float; use abs(z)
</pre>
</div>


<p>
Modulo cmath contiene funciones para trabajar con números complejos.
</p>

<p>
Vamos a demostrar que \[ sin(ai) = i*sinh(a) \]
</p>

<div class="org-src-container">

<pre class="src src-python">from cmath import sin, sinh
r1 = sin(8j)
r1
# 1490.4788257895502j
r2 = 1j*sinh(8)
r2
# 1490.4788257895502j
</pre>
</div>

<p>
Las funciones de cmath solo devuelve valores complejos.
</p>

<p>
Quisieramos tener funciones que devuelven un objeto flotante si el resultado es un número real y un objeto complejo si el resultado es un número complejo.
</p>

<div class="org-src-container">

<pre class="src src-python">from math import sqrt
sqrt(4) # float
# 2.0
sqrt(-1) # illegal

from cmath import sqrt
sqrt(4) # complex
# (2+0j)
sqrt(-1) # complex
# 1j

from numpy.lib.scimath import *
sqrt(4) # float
# 2.0
sqrt(-1) # complex
# 1j
</pre>
</div>

<p>
Calculando las raices de la función cuadrática f(x) = ax<sup>2</sup> + bx + c
</p>

<div class="org-src-container">

<pre class="src src-python">from numpy.lib.scimath import sqrt
a = 1; b = 2; c = 100 # polynomial coefficients 
r1 = (-b + sqrt(b**2 - 4*a*c))/(2*a)
r2 = (-b - sqrt(b**2 - 4*a*c))/(2*a)

r1
# (-1+9.94987437107j)
r2
# (-1-9.94987437107j
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Computación Simbólica</h2>
<div class="outline-text-2" id="text-3">
<p>
Refiere al estudio y desarrollo de algoritmos y software para la manipulación de expresiones y objetos matemáticos.
</p>

<p>
Enfatiza el cálculo exacto con expresiones que contengan variables y que no tienen un valor dado,
</p>

<p>
por lo tanto son manipulados como símbolos (de ahí se debe el nombre de cálculo simbólico).
</p>

<p>
El paquete <b>sympy</b> permite hacer la computación simbólica, como integración,  diferenciación, solución de  ecuaciones, etc.
</p>

<p>
Vamos a diferenciar la fórmula: \[ y =  v_0t - \frac{1}{2}gt^2 \] con respecto a t y luego integrar la respuesta.
</p>

<div class="org-src-container">

<pre class="src src-python">from sympy import (
 symbols, # define mathematical symbols for symbolic math
 diff, # differentiate expressions
 integrate, # integrate expressions
 Rational, # define rational numbers
 lambdify, # turn symbolic expressions into Python functions
 )

t, v0, g = symbols("t v0 g")
y = v0*t - Rational(1,2)*g*t**2
dydt = diff(y, t)
dydt
# -g*t + v0
print("acceleration:", diff(y, t, t)) # 2nd derivative
# acceleration: -g
y2 = integrate(dydt, t)
print(y2)
# -g*t**2/2 + t*v0
</pre>
</div>


<ul class="org-ul">
<li>t es una variable simbolica, no un flotante
</li>
<li>y es una expresión simbolica.
</li>
</ul>

<p>
Las expresiones simbólicas puede convertirse en funciones ordinarias de Python a través de <b>lambdify</b>.
</p>

<div class="org-src-container">

<pre class="src src-python">v = lambdify([t, v0, g], dydt) # regresar a una funcion v(t, v0, g)
v(0, 5, 9.81)
# 5
v(2, 5, 9.81)
# -14.62
5 - 9.81*2 # Haciendo el calculo a manita
# -14.62
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Solución de ecuaciones</h2>
<div class="outline-text-2" id="text-4">
<p>
Podemos resolver una ecuación lineal definida por una expresión que es 0.
</p>

<p>
Encontrar las raices cuando y = 0 y t es la variable desconocida.
</p>

<div class="org-src-container">

<pre class="src src-python"># Find t values such that y=0
from sympy import solve
roots = solve(y, t)
roots
#[0, 2*v0/g]
</pre>
</div>

<p>
Podemos checar el resultado insertando las raices en la ecuación y.
</p>

<div class="org-src-container">

<pre class="src src-python">y.subs(t, roots[0])
y.subs(t, roots[1])
</pre>
</div>


<p>
Hay herramientas para expandir y simplificar una expresión:
</p>

<div class="org-src-container">

<pre class="src src-python">from sympy import simplify, expand
x, y = symbols("x y")
f = -sin(x)*sin(y) + cos(x)*cos(y)

s = simplify(f)
print(s)
# cos(x + y)

ex = expand(sin(x+y), trig=True) # requires a trigonometric hint
print(ex)
# sin(x)*cos(y) + sin(y)*cos(x)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Ejercicio</h2>
<div class="outline-text-2" id="text-5">
<p>
Resuelve la ecuación: 7x + 3 (x + 1) = 2x / 4 - 1
</p>

<ol class="org-ol">
<li>Define la ecuación usando sympy.
</li>

<li>Diferenciar la expresión en 1) una y dos veces.
</li>
</ol>
<p>
Ahora define y<sub>2</sub> que es la expresión integrada de la primera derivada
</p>

<ol class="org-ol">
<li>Encuentra las raíces: los valores de la ecuación cuando es igual a 0. Inserta las raíces para verificar los resultados.
</li>
</ol>

<p>
Imprime todos los valores.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fernanda Sanchez</p>
<p class="date">Created: 2016-08-24 Wed 19:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
